docs/state.mmd
graph TD
START((START)) -.-> INSTR_FETCH

INSTR_FETCH --> INSTR_DECODE{INSTR_DECODE}

INSTR_DECODE -->|"{L|S}{D|W|H|B}"| MEM_ADDRESS_COMP(MEM_ADDRESS_COMP)
INSTR_DECODE -->|"ADDI, S{R|L}"| IMM_ARITH(IMM_ARITH)
INSTR_DECODE -->|"TYPE R"| EXEC_TYPE_R(EXEC_TYPE_R)
INSTR_DECODE -->|"TYPE U"| EXEC_TYPE_U(EXEC_TYPE_U)
INSTR_DECODE -->|"B{EQ|NE|GE|LE}"| BRANCH_COMPL(BRANCH_COMPL)


MEM_ADDRESS_COMP -->|"L{D|W|H|BU}"| MEM_ACC_LD
MEM_ADDRESS_COMP -->|"S{D|W|H|B}"| MEM_ACC_SD
MEM_ACC_LD --> WAIT_READ_DATA_MEM
WAIT_READ_DATA_MEM --> WRITE_BACK

EXEC_TYPE_R --> ARITH_COMPL
EXEC_TYPE_U --> ARITH_COMPL
IMM_ARITH   --> ARITH_COMPL

BRANCH_COMPL --> WAIT_READ_INSTR_MEM

WAIT_READ_INSTR_MEM -.-> INSTR_FETCH
WRITE_BACK -.-> INSTR_FETCH
MEM_ACC_SD -.-> INSTR_FETCH
ARITH_COMPL -.-> INSTR_FETCH
